//! 1) ახსენი რას აკეთებს alert
// * alert გამოაქვს პირდაპირ და გვიჩვენებს რაღაცს
//! 2) ახსენი რას აკეთებს prompt
// * prompt გამოაქვს და უნდა ჩავწეროთ რაღაცა
//! 3) ახსენი რა განსხვავებაა alert-სა და prompt-ს შორის
// ? alert - ს გამოაქვს პირდაპირ და არ შეგვიძლია ჩაწერა  მაგრამ prompt - ში რასაც გვეუბნება ან გვეკითხება უნდა ჩავწეროთ
//! 4) გამოიტანეთ alert-ით "hello world" მესიჯი
 alert("Hello World")
//! 5) მომხმარებელს შემოატანინე 2 რიცხვი და მოახდინე ყველა მათემატიკური ოპერაცია
 let numi = prompt("ჩაწერე 2 რიცხვი")
 console.log(numi + 1)
 console.log(numi - 1)
 console.log(numi / 1)
 console.log(numi * 1)
//! 6) მომხმარებელს შემოატანინეთ ასაკი და შეამოწმეთ სრულწლოვანია თუ არა  (გამოიტანეთ alert-ით) 
//! 7)  შექმენი 2 ცვლადი, სადაც მომხმარებელს შემოატანინებ რიცხვებს. შეამოწმე რომელი რიცხვია დადებითი და რომელი უარყოფითი (გამოიტანეთ console.log()-ით) 
//! 8) შექმენი 3 ცვლადი, ერთი იყოს რო მომხმარებელს უნდა შემოატანინო მათემატიკური სიმბოლო (+, -, *, /, %), დანარჩენი ორი ცვლადი უნდა იყოს რიცხვები. სიმბოლოს მიხედვით შეასრულე ამ ორ ცვლადში სადაც რიცხვები, არის შესრულდეს მოქმედება. (შედეგი გამოიტანეთ console.log-ით)