// 1) შექმენი ღილაკი. დაჭერისას <div>-ში innerHTML-ის დახმარებით გამოჩნდეს ტექსტი: "Hello JavaScript".
// 2) გქონდეს <div id="box"></div>. JS-ით ჩაამატე შიგნით <h2> სათაური და <p> ტექსტი innerHTML-ის გამოყენებით.
// 3) ღილაკზე დაჭერისას innerHTML-ით შეცვალე <div>-ის შიგთავსი ისე, რომ ძველი ტექსტი გაქრეს და ახალი გამოჩნდეს.
// 4) შექმენი <div> და CSS კლასი .red (წითელი ფონი). ღილაკზე დაჭერისას classList.add()-ით დაამატე ეს კლასი.
// 5) მეორე ღილაკზე დაჭერისას classList.remove()-ით მოაშორე .red კლასი.
// 6) ერთი ღილაკით გააკეთე კლასის ჩართვა/გამორთვა classList.toggle()-ის გამოყენებით.