//! 1) შექმენი ცვლადი სადაც მომხმარებელს შემოატანინებთ სახელ. შემდეგ შექმენი პირობა რომელიც ამოწმებს, რომ თუ სახელი უდრის გიორგის მაშინ გამოგვიტანოს "ნაცნობია", სხვა შემთხვევაში "არ ვიცნობ ამ პიროვნებას"
//! 2) შექმენი 2 ცვლადი, სადაც მომხმარებელს შემოატანინებ რიცხვებს. შეამოწმე ეს რიცხვები დადებითია თუ უარყოფითი
//! 3)  შექმენი 2 ცვლადი, სადაც მომხმარებელს შემოატანინებ რიცხვებს. შეამოწმე ეს რიცხვები ერთმანეთს უდრის თუ არა, ასევე შეამოწმე რომელი რიცხვია მეტი და რომელი რიცხვია პატარა
//! 4) შექმენი 3 ცვლადი, ერთი იყოს რო მომხმარებელს უნდა შემოატანინო მათემატიკური სიმბოლო (+, -, *, /, %), დანარჩენი ორი ცვლადი უნდა იყოს რიცხვები. სიმბოლოს მიხედვით შეასრულე ამ ორ ცვლადში სადაც რიცხვები, არის შესრულდეს მოქმედება. (შედეგი გამოიტანეთ console.log-ით) 
//! 5) ახსენი რა განსხვავებაა ორტოლობასა და სამტოლობას შორის

// ? 1
const name = Name(prompt("please enter your name"))
if (name == "george") {
    console.log("ნაცნობი ხარ")
} else {
    console.log("არ ვიცნობ ამ პირობას")
}

// // ? 2
// let age = age(prompt("enter your age"))
// let number = Number(prompt("enter eny number"))

// if (age,number % 2 == 0) {
//     alert("posetive")
// } else {
//     alert("negative")
// }

// // ? 3
// let num = num(prompt("enter num"))
// let ss = ss(prompt("enter eny num"))

// if (num,ss = )