// 1) კომენტარების სახით ახსენით რა არის ფუნქცია და რისთვის გამოიყენება.
// ფუნქცია არის კოდის ბლოკი, რომელსაც მიენიჭება სახელი და რომელსაც შეიძლება გაეწარმოებინოს კონკრეტული ოპერაცია.
// ფუნქცია შეიძლება მიიღებდეს არგუმენტებს და დააბრუნებდეს მნიშვნელობას.

// 2) კომენტარების სახით ახსენით რა განსხვავებაა პითონის ფუნქციასა და ჯავასკრიპტის ფუნქციას შორის?
//   სინტაქსი: Python-ში ფუნქცია წერია "def name(...):" და ბლოკი განსაზღვრულია indentation-ით.
//   JavaScript-ში ფუნქცია შეიძლება იყოს "function name(...) { ... }" ან arrow function "(...) => { ... }".
 
// 3) შექმენით ჯავასკრიპტის ფუნქცია რომელიც გადაეცემა name, და შენი პროგრამა ესალმება ამ name-ს
function greet(name) {
    console.log("hello" + " " + name + "!")
}
greet("Alex")

// 4) შექმენით ფუნქცია რომელიც გადაეცემა 4 რიცხვი და შენი პროგრამა დააბრუნებს ამ რიცხვების ჯამს
function pl(a , b , c , d) {
    console.log(a + b + c + d)
}
pl(10 , 10 , 10 , 10)

// 5) ახსენი რა განსხვავებაა ჩვეულებრივ ფუნქციასა და arrow function-ს შორის.
// - სინტაქსი: ჩვეულებრივი ფუნქცია: functionName(...) { ... }
//   Arrow ფუნქცია: (...) => { ... }
// - arguments ობიექტი: ჩვეულებრივი ფუნქციას აქვს arguments; Arrow ფუნქციებს არ აქვთ arguments.

// 6) შექმენი arrow function რომელსაც გადეცემა რიცხვი და გაიგებ ეს რიცხვი ლუწია თუ კენტი
const checkEvenOdd = (num) => {
    prompt("გთხოვთ შემოიყვანოთ რიცხვი კენტი ან ლუწი")

    if (num % 2 == 0) {
        console.log("რიცხვი ლუწია")
    } else {
        console.log("რიცხვი კენტია")
    }
}

checkEvenOdd(10)
checkEvenOdd(11)
// 7) შექმენი  arrow function სახელად countLetters, რომელსაც გადაეცემა სტრინგი და დააბრუნებს რამდენი ასოა სტრიქონში
// ვერ გავიგე